{
  "architectures": [
    "EfficientNetForImageClassification"
  ],
  "batch_norm_eps": 0.001,
  "batch_norm_momentum": 0.99,
  "depth_coefficient": 1.0,
  "depth_divisor": 8,
  "depthwise_padding": [],
  "drop_connect_rate": 0.2,
  "dropout_rate": 0.2,
  "dtype": "float32",
  "expand_ratios": [
    1,
    6,
    6,
    6,
    6,
    6,
    6
  ],
  "hidden_act": "swish",
  "hidden_dim": 1280,
  "id2label": {
    "0": "Apple___Healthy",
    "1": "Apple___Rust",
    "2": "Apple___Scab",
    "3": "Bell_Pepper___Bacterial_spot",
    "4": "Bell_Pepper___Healthy",
    "5": "Bell_Pepper___Leaf_Spot",
    "6": "Blueberry___Healthy",
    "7": "Cherry___Healthy",
    "8": "Corn___Gray_leaf_spot",
    "9": "Corn___Leaf_blight",
    "10": "Corn___Rust_Leaf",
    "11": "Grape___Healthy",
    "12": "Grape___Leaf_Black_Rot",
    "13": "Peach___Healthy",
    "14": "Potato_Leaf___Early_Blight",
    "15": "Potato_Leaf___Late_Blight",
    "16": "Potato___Early_Blight",
    "17": "Potato___Healthy",
    "18": "Potato___Late_Blight",
    "19": "Raspberry___Healthy",
    "20": "Rice___Bacterial_Leaf_Blight",
    "21": "Rice___Brown_Spot",
    "22": "Rice___Leaf_Smut",
    "23": "Soyabean___Healthy",
    "24": "Strawberry___Healthy",
    "25": "Tomato_Leaf___Bacterial_Spot",
    "26": "Tomato_Leaf___Late_Blight",
    "27": "Tomato_Leaf___Mosaic_Virus",
    "28": "Tomato_Leaf___Yellow_Virus",
    "29": "Tomato___Early_Blight",
    "30": "Tomato___Early_Blight_Leaf",
    "31": "Tomato___Healthy",
    "32": "Tomato___Late_Blight",
    "33": "Tomato___Mold_Leaf",
    "34": "Tomato___Septoria_Leaf_Spot",
    "35": "Tomato___Spider_Mites",
    "36": "Tomato___Target_Spot",
    "37": "Tomato___YellowLeaf_Curl_Virus"
  },
  "image_size": 224,
  "in_channels": [
    32,
    16,
    24,
    40,
    80,
    112,
    192
  ],
  "initializer_range": 0.02,
  "kernel_sizes": [
    3,
    3,
    5,
    3,
    5,
    5,
    3
  ],
  "label2id": {
    "Apple___Healthy": 0,
    "Apple___Rust": 1,
    "Apple___Scab": 2,
    "Bell_Pepper___Bacterial_spot": 3,
    "Bell_Pepper___Healthy": 4,
    "Bell_Pepper___Leaf_Spot": 5,
    "Blueberry___Healthy": 6,
    "Cherry___Healthy": 7,
    "Corn___Gray_leaf_spot": 8,
    "Corn___Leaf_blight": 9,
    "Corn___Rust_Leaf": 10,
    "Grape___Healthy": 11,
    "Grape___Leaf_Black_Rot": 12,
    "Peach___Healthy": 13,
    "Potato_Leaf___Early_Blight": 14,
    "Potato_Leaf___Late_Blight": 15,
    "Potato___Early_Blight": 16,
    "Potato___Healthy": 17,
    "Potato___Late_Blight": 18,
    "Raspberry___Healthy": 19,
    "Rice___Bacterial_Leaf_Blight": 20,
    "Rice___Brown_Spot": 21,
    "Rice___Leaf_Smut": 22,
    "Soyabean___Healthy": 23,
    "Strawberry___Healthy": 24,
    "Tomato_Leaf___Bacterial_Spot": 25,
    "Tomato_Leaf___Late_Blight": 26,
    "Tomato_Leaf___Mosaic_Virus": 27,
    "Tomato_Leaf___Yellow_Virus": 28,
    "Tomato___Early_Blight": 29,
    "Tomato___Early_Blight_Leaf": 30,
    "Tomato___Healthy": 31,
    "Tomato___Late_Blight": 32,
    "Tomato___Mold_Leaf": 33,
    "Tomato___Septoria_Leaf_Spot": 34,
    "Tomato___Spider_Mites": 35,
    "Tomato___Target_Spot": 36,
    "Tomato___YellowLeaf_Curl_Virus": 37
  },
  "model_type": "efficientnet",
  "num_block_repeats": [
    1,
    2,
    2,
    3,
    3,
    4,
    1
  ],
  "num_channels": 3,
  "num_hidden_layers": 64,
  "out_channels": [
    16,
    24,
    40,
    80,
    112,
    192,
    320
  ],
  "out_features": null,
  "pooling_type": "mean",
  "problem_type": "single_label_classification",
  "squeeze_expansion_ratio": 0.25,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7"
  ],
  "strides": [
    1,
    2,
    2,
    2,
    1,
    2,
    1
  ],
  "transformers_version": "5.4.0",
  "use_cache": false,
  "width_coefficient": 1.0
}
